atanisoft/ESP32CommandStation/lib/OpenMRN/src/os/os.c
    return 0;
}
#elif defined (__WIN32__)
/** Windows does not support pipes, so we made our own with a pseudo socketpair.
 * @param fildes fildes[0] is open for reading, filedes[1] is open for writing
 * @return 0 upon success, else -1 with errno set to indicate error
 */
int pipe(int fildes[2])
{
    struct sockaddr_in addr;  
    int listener, connector, acceptor;
    socklen_t addrlen = sizeof(addr);

    if ((listener = socket(AF_INET, SOCK_STREAM, 0)) <= 0)
    {
        errno = EMFILE;
        return -1;
    }
    if ((connector = socket(AF_INET, SOCK_STREAM, 0)) <= 0)
    {
        closesocket(listener);
        errno = EMFILE;
        return -1;
    }
    
    memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_addr.s_addr = htonl(INADDR_LOOPBACK);
    addr.sin_port = 0; 

    int reuse = 0;
    if (setsockopt(listener, SOL_SOCKET, SO_REUSEADDR, 
                   (char*)&reuse, (socklen_t)sizeof(reuse)) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }

    if (bind(listener, (const struct sockaddr*)&addr, sizeof(addr)) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }
    
    if  (getsockname(listener, (struct sockaddr*)&addr, &addrlen) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }

    if (listen(listener, 1) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }

    if (connect(connector, (const struct sockaddr*)&addr, addrlen) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }
   
    if ((acceptor = accept(listener, NULL, NULL)) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return  -1;
    }

    int flag = 1;
    setsockopt(connector, IPPROTO_TCP, TCP_NODELAY, (char*)&flag, sizeof(int));
    setsockopt(acceptor, IPPROTO_TCP, TCP_NODELAY, (char*)&flag, sizeof(int));

    fildes[0] = connector;
    fildes[1] = acceptor;
    closesocket(listener);
    return 0;
}
#endif

#if defined (__FreeRTOS__)
extern const void* stack_malloc(unsigned long length);

#endif  // FreeRTOS

/** Entry point to a thread.
 * @param arg metadata for entering the thread
 */
#if defined (__FreeRTOS__)
static void os_thread_start(void *arg)
{
    ThreadPriv *priv = arg;
    vTaskSetApplicationTaskTag(NULL, arg);
    _impure_ptr = priv->reent;
    (*priv->entry)(priv->arg);

    vTaskSuspendAll();
    TaskList *tl;
    for (tl = taskList; tl != NULL && tl->task != xTaskGetCurrentTaskHandle();
         tl = tl->next)
    {
    }
    if (tl)
    {
        tl->task = NULL;
        tl->unused = DELETED_TASK_MAGIC;
    }
    xTaskResumeAll();

    free(priv->reent);
    free(priv);
    vTaskDelete(NULL);
}
#endif

#if !(defined(__EMSCRIPTEN__) || defined(ESP_NONOS) || defined(ARDUINO))

#if defined(__FreeRTOS__)
#if (configSUPPORT_STATIC_ALLOCATION == 1)
/** Static memory allocators for idle system thread.
 * @param pxIdleTaskTCBBuffer pointer to pointer to TCB
 * @param pxIdelTaskStackBuffer pointer to pointer to Stack
 * @param ulIdleTaskStackSize pointer to stack size
 */

void vApplicationGetIdleTaskMemory(StaticTask_t **pxIdleTaskTCBBuffer,
                                   StackType_t **pxIdleTaskStackBuffer,
                                   uint32_t *ulIdleTaskStackSize);

void vApplicationGetIdleTaskMemory(StaticTask_t **pxIdleTaskTCBBuffer,
                                   StackType_t **pxIdleTaskStackBuffer,
                                   uint32_t *ulIdleTaskStackSize)
{
    const uint32_t stksz = configMINIMAL_STACK_SIZE*sizeof(StackType_t);
    *pxIdleTaskTCBBuffer = (StaticTask_t *) malloc(sizeof(StaticTask_t));
    HASSERT(*pxIdleTaskTCBBuffer);
    *pxIdleTaskStackBuffer = (StackType_t *) malloc(stksz);
    HASSERT(*pxIdleTaskStackBuffer);
    *ulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}

/** Static memory allocators for timer system thread.
 * @param pxTimerTaskTCBBuffer pointer to pointer to TCB
 * @param pxIdelTaskStackBuffer pointer to pointer to Stack
 * @param ulTimerTaskStackSize pointer to stack size
 */

void vApplicationGetTimeraskMemory(StaticTask_t **pxTimerTaskTCBBuffer,
                                   StackType_t **pxTimerTaskStackBuffer,
                                   uint32_t *ulTimerTaskStackSize);

void vApplicationGetTimerTaskMemory(StaticTask_t **pxTimerTaskTCBBuffer,
                                   StackType_t **pxTimerTaskStackBuffer,
                                   uint32_t *ulTimerTaskStackSize)
{
    const uint32_t stksz = configMINIMAL_STACK_SIZE*sizeof(StackType_t);
    *pxTimerTaskTCBBuffer = (StaticTask_t *) malloc(sizeof(StaticTask_t));
    HASSERT(*pxTimerTaskTCBBuffer);
    *pxTimerTaskStackBuffer = (StackType_t *) malloc(stksz);
    HASSERT(*pxTimerTaskStackBuffer);
    *ulTimerTaskStackSize = configMINIMAL_STACK_SIZE;
}
#endif // configSUPPORT_STATIC_ALLOCATION

/** Add a thread to the task list for tracking.
 * @param task_new metadata for new task
 */
static void add_thread_to_task_list(TaskList *task_new)
{
    vTaskSuspendAll();
    task_new->next = taskList;
    taskList = task_new;
    xTaskResumeAll();
}
#endif // FreeRTOS

/** Create a thread.
 * @param thread handle to the created thread
 * @param name name of thread, NULL for an auto generated name
 * @param priority priority of created thread, 0 means default,
 *        lower numbers means lower priority, higher numbers mean higher priority
 * @param stack_size size in bytes of the created thread's stack
 * @param start_routine entry point of the thread
 * @param arg entry parameter to the thread
 * @return 0 upon success or error number upon failure
 */
int os_thread_create(os_thread_t *thread, const char *name, int priority,
                     size_t stack_size,
                     void *(*start_routine) (void *), void *arg)
{
    static unsigned int count = 0;
    char auto_name[10];

    if (name == NULL)
    {
        strcpy(auto_name, "thread.");
        auto_name[9] = '\0';
        auto_name[8] = '0' + (count % 10);
        auto_name[7] = '0' + (count / 10);
        count++;
        name = auto_name;
    }

#if defined (__FreeRTOS__)
    ThreadPriv *priv = malloc(sizeof(ThreadPriv));
    
