atanisoft/ESP32CommandStation/lib/OpenMRN/src/os/os.c
    priv->entry = start_routine;
    priv->selectEventBit = 0;
    priv->arg = arg;
    priv->reent = allocate_reent();
    
    if (priority == 0)
    {
        priority = configMAX_PRIORITIES / 2;
    }
    else if (priority >= configMAX_PRIORITIES)
    {
        priority = configMAX_PRIORITIES - 1;
    }
    
    if (stack_size == 0)
    {
        stack_size = 2048;
    }

    TaskList *task_new = malloc(sizeof(TaskList));
    task_new->unused = stack_size;
    
#if (configSUPPORT_STATIC_ALLOCATION == 1)
    if (thread)
    {
        *thread = xTaskCreateStatic(os_thread_start,
                                    (const char *const)name,
                                    stack_size/sizeof(portSTACK_TYPE),
                                    priv,
                                    priority,
                                    (StackType_t *)stack_malloc(stack_size),
                                    (StaticTask_t *) malloc(sizeof(StaticTask_t)));
        task_new->task = *thread;
        task_new->name = (char*)pcTaskGetTaskName(*thread);
    }
    else
    {
        xTaskHandle task_handle;
        task_handle = xTaskCreateStatic(os_thread_start,
                                        (const char *const)name,
                                        stack_size/sizeof(portSTACK_TYPE),
                                        priv,
                                        priority,
                                        (StackType_t *) stack_malloc(stack_size),
                                        (StaticTask_t *) malloc(sizeof(StaticTask_t)));
        task_new->task = task_handle;
        task_new->name = (char*)pcTaskGetTaskName(task_handle);
    }
#elif (configSUPPORT_DYNAMIC_ALLOCATION == 1)
    if (thread)
    {
        xTaskCreate(os_thread_start,
                    (const char *const)name,
                    stack_size/sizeof(portSTACK_TYPE),
                    priv,
                    priority,
                    thread);
        task_new->task = *thread;
        task_new->name = (char*)pcTaskGetTaskName(*thread);
    }
    else
    {
        xTaskHandle task_handle;
        xTaskCreate(os_thread_start,
                    (const char *const)name,
                    stack_size/sizeof(portSTACK_TYPE),
                    priv,
                    priority,
                    &task_handle);
        task_new->task = task_handle;
        task_new->name = (char*)pcTaskGetTaskName(task_handle);
    }
#else  // prior to v9.0.0
    if (thread)
    {
        xTaskGenericCreate(os_thread_start,
                           (const char *const)name,
                           stack_size/sizeof(portSTACK_TYPE),
                           priv,
                           priority,
                           (xTaskHandle*)thread,
                           (long unsigned int*)stack_malloc(stack_size),
                           NULL);
        task_new->task = *thread;
        task_new->name = (char*)pcTaskGetTaskName(*thread);
    }
    else
    {
        xTaskHandle task_handle;
        xTaskGenericCreate(os_thread_start,
                           (const char *const)name,
                           stack_size/sizeof(portSTACK_TYPE),
                           priv,
                           priority,
                           (xTaskHandle*)&task_handle,
                           (long unsigned int*) stack_malloc(stack_size),
                           NULL);
        task_new->task = task_handle;
        task_new->name = (char*)pcTaskGetTaskName(task_handle);
    }
#endif
    add_thread_to_task_list(task_new);

    return 0;
#else // not freertos
    pthread_attr_t attr;

    int result = pthread_attr_init(&attr);
    if (result != 0)
    {
        return result;
    }
    result = pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
    if (result != 0)
    {
        return result;
    }

#if !defined(__linux__) && !defined(__MACH__) /* Linux allocates stack as needed */
    struct sched_param sched_param;
    result = pthread_attr_setstacksize(&attr, stack_size);
    if (result != 0)
    {
        return result;
    }

    sched_param.sched_priority = 0; /* default priority */
    result = pthread_attr_setschedparam(&attr, &sched_param);
    if (result != 0)
    {
        return result;
    }

    result = pthread_attr_setinheritsched(&attr, PTHREAD_EXPLICIT_SCHED);
    if (result != 0)
    {
        return result;
    }

    result = pthread_attr_setschedpolicy(&attr, SCHED_FIFO);
    if (result != 0)
    {
        return result;
    }
#endif // not linux and not mac
    result = pthread_create(thread, &attr, start_routine, arg);

#if !defined (__MINGW32__) && !defined (__MACH__)
    if (!result) pthread_setname_np(*thread, name);
#endif

    return result;
#endif // freertos or not
}
#endif // __EMSCRIPTEN__

/// Implement this function to read timing more accurately than 1 msec in
/// FreeRTOS.
extern long long hw_get_partial_tick_time_nsec(void);
/// Default implementation does not provide more accuracy.
long long __attribute__((weak)) hw_get_partial_tick_time_nsec() { return 0; }

long long os_get_time_monotonic(void)
{
    static long long last = 0;
    long long time;
#if defined (__FreeRTOS__)
    portTickType tick = xTaskGetTickCount();
    time = ((long long)tick) << NSEC_TO_TICK_SHIFT;
    time += hw_get_partial_tick_time_nsec();
#elif defined (__MACH__)
    /* get the timebase info */
    mach_timebase_info_data_t info;
    mach_timebase_info(&info);
    
    /* get the timestamp */
    time = (long long)mach_absolute_time();
    
    /* convert to nanoseconds */
    time *= info.numer;
    time /= info.denom;
#elif defined (__WIN32__)
    struct timeval tv;
    gettimeofday(&tv, NULL);
    time = ((long long)tv.tv_sec * 1000LL * 1000LL * 1000LL) +
           ((long long)tv.tv_usec * 1000LL);
#elif defined(ARDUINO)
    static uint32_t last_millis = 0;
    auto new_millis = millis();
    static uint32_t overflow_millis = 0;
    if (new_millis < last_millis)
    {
        ++overflow_millis;
    }
    time = overflow_millis;
    time <<= 32;
    time += new_millis;
    time *= 1000000;
#elif defined(ESP_NONOS)
    static uint32_t clockmul = 0;
    if (clockmul == 0) {
        clockmul = system_rtc_clock_cali_proc();
        clockmul *= 1000;
        clockmul >>= 10;
    }
    time = system_get_rtc_time();
    time *= clockmul;
    time >>= 2;
#else
    struct timespec ts;
#if defined (__nuttx__)
    clock_gettime(CLOCK_REALTIME, &ts);
#else
    clock_gettime(CLOCK_MONOTONIC, &ts);
#endif
    time = ((long long)ts.tv_sec * 1000000000LL) + ts.tv_nsec;
    
#endif
    /* This logic ensures that every successive call is one value larger
     * than the last.  Each call returns a unique value.
     */
    if (time <= last)
    {
        last++;
    }
    else
    {
        last = time;
    }

