atanisoft/ESP32CommandStation/lib/OpenMRN/src/os/os.c
    return last;
}

#if defined(__EMSCRIPTEN__)
int os_thread_once(os_thread_once_t *once, void (*routine)(void))
{
    if (once->state == OS_THREAD_ONCE_NEVER)
    {
        once->state = OS_THREAD_ONCE_INPROGRESS;
        routine();
        once->state = OS_THREAD_ONCE_DONE;
    }
    else if (once->state == OS_THREAD_ONCE_INPROGRESS)
    {
        DIE("Recursive call to os_thread_once.");
    }
    return 0;
}
#endif

#if defined (__FreeRTOS__)
/* standard C library hooks for multi-threading */

/** Lock access to malloc.
 */
void __malloc_lock(void)
{
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED)
    {
        vTaskSuspendAll();
    }
}

/** Unlock access to malloc.
 */
void __malloc_unlock(void)
{
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED)
    {
        xTaskResumeAll();
    }
}

#if defined (_REENT_SMALL)
void *__real__malloc_r(size_t size);
void __real__free_r(void *address);

/** malloc() wrapper for newlib-nano
 * @param size size of malloc in bytes
 * @return pointer to newly malloc'd space
 */
void *__wrap__malloc_r(size_t size)
{
    void *result;
    __malloc_lock();
    result = __real__malloc_r(size);
    __malloc_unlock();
    return result;
}

/** free() wrapper for newlib-nano
 * @param address pointer to previously malloc'd address
 */
void __wrap__free_r(void *address)
{
    __malloc_lock();
    __real__free_r(address);
    __malloc_unlock();
}
#endif

/** Implementation of standard sleep().
 * @param seconds number of seconds to sleep
 */
unsigned sleep(unsigned seconds)
{
    vTaskDelay(seconds * configTICK_RATE_HZ);
    return 0;
}

/** Implementation of standard usleep().
 * @param usec number of microseconds to sleep
 */
int usleep(useconds_t usec)
{
    long long nsec = usec;
    nsec *= 1000;
    vTaskDelay(nsec >> NSEC_TO_TICK_SHIFT);
    return 0;
}

void abort(void)
{
#if defined(TARGET_LPC2368) || defined(TARGET_LPC11Cxx) || defined(TARGET_LPC1768) || defined(GCC_ARMCM3) || defined (GCC_ARMCM0) || defined(TARGET_PIC32MX)
    diewith(BLINK_DIE_ABORT);
#endif
    for (;;)
    {
    }
}

/* magic that allows for an optional second heap region */
char __attribute__((weak)) __heap2_start_alias;
extern char __heap2_start __attribute__((weak, alias ("__heap2_start_alias")));
extern char __heap2_end __attribute__((weak, alias ("__heap2_start_alias")));

extern char *heap_end;
char *heap_end = 0;
extern char *heap2_end;
char *heap2_end = 0;
void* _sbrk_r(struct _reent *reent, ptrdiff_t incr)
{
    /** @todo (Stuart Baker) change naming to remove "cs3" convention */
    extern char __cs3_heap_start;
    extern char __cs3_heap_end; /* Defined by the linker */
    char *prev_heap_end;
    if (heap_end == 0)
    {
        heap_end = &__cs3_heap_start;
    }
    if (heap2_end == 0)
    {
        heap2_end = &__heap2_start;
    }
    prev_heap_end = heap_end;
    if ((heap_end + incr) > &__cs3_heap_end)
    {
        if (&__heap2_start != &__heap2_end)
        {
            /* there is a second heap */
            char *prev_heap2_end;
            prev_heap2_end = heap2_end;
            if ((heap2_end + incr) <= &__heap2_end)
            {
                heap2_end += incr;
                return (caddr_t) prev_heap2_end;
            }
        }
        /* Heap and stack collistion */
        diewith(BLINK_DIE_OUTOFMEM);
        return 0;
    }
    heap_end += incr;
    return (caddr_t) prev_heap_end;
}

xTaskHandle volatile overflowed_task = 0;
signed portCHAR * volatile overflowed_task_name = 0;

/** This method is called if a stack overflows its boundries.
 * @param task task handle for violating task
 * @param name name of violating task
 */
void vApplicationStackOverflowHook(xTaskHandle task, signed portCHAR *name)
{
    overflowed_task = task;
    overflowed_task_name = name;
    diewith(BLINK_DIE_STACKOVERFLOW);
}

/** This method will be called repeatedly from the idle task. If needed, it can
 * be overridden in hw_init.c.
 */
void hw_idle_hook(void) __attribute__((weak));

void hw_idle_hook(void)
{
}

/** Here we will monitor the other tasks.
 */
void vApplicationIdleHook( void )
{
    hw_idle_hook();
    vTaskSuspendAll();
    // First we clean up all deleted tasks.
    for (TaskList **ptl = &taskList; *ptl != NULL;)
    {
        if ((*ptl)->unused == DELETED_TASK_MAGIC)
        {
            TaskList *tl = *ptl;
            *ptl = tl->next;
            free(tl);
        }
        else
        {
            ptl = &((*ptl)->next);
        }
    }
    // Then we scan through the tasks and update the free stack values.
    for (TaskList *tl = taskList; tl != NULL; tl = tl->next)
    {
        if (tl->task)
        {
            tl->unused = uxTaskGetStackHighWaterMark(tl->task) * sizeof(portSTACK_TYPE);
        }
        xTaskResumeAll();
        vTaskSuspendAll();
    }
    xTaskResumeAll();
}

#ifdef TARGET_PIC32MX
static void __attribute__((nomips16)) os_yield_trampoline(void) {
    taskYIELD();
}

void __attribute__((nomips16)) os_isr_exit_yield_test(int woken) {
   portEND_SWITCHING_ISR(woken); 
}

#else
static inline void __attribute__((always_inline)) os_yield_trampoline(void) {
    taskYIELD();
}
#endif

/** Entry point to the main thread.
 * @param arg unused argument
 * @return NULL;
 */
void main_thread(void *arg)
{
    ThreadPriv *priv = arg;
    char *argv[2] = {"nmranet", NULL};
    vTaskSetApplicationTaskTag(NULL, arg);
    _impure_ptr = priv->reent;

    /* setup the monitoring entries for the timer and idle tasks */
#if configUSE_TIMERS
    TaskList *task_new = malloc(sizeof(TaskList) * 2);
    task_new->task = xTimerGetTimerDaemonTaskHandle();
    task_new->name = (char*)pcTaskGetTaskName(task_new->task);
    task_new->unused = uxTaskGetStackHighWaterMark(task_new->task);
    add_thread_to_task_list(task_new);
    ++task_new;
#else
    TaskList *task_new = malloc(sizeof(TaskList));
#endif
    task_new->task = xTaskGetIdleTaskHandle();
    task_new->name = (char*)pcTaskGetTaskName(task_new->task);
    task_new->unused = uxTaskGetStackHighWaterMark(task_new->task);
    add_thread_to_task_list(task_new);

