atanisoft/ESP32CommandStation/lib/OpenMRN/src/os/os.c
    /* Allow any library threads to run that must run ahead of main */
    os_yield_trampoline();

    /* Give another chance to the board file to do work, this time coordinating
     * between application and library threads. */
    hw_postinit();

    appl_main(1, argv);
    // If the main thread returns, FreeRTOS usually crashes the CPU in a
    // hard-to-debug state. Let's avoid that.
    abort();
}
#endif

/** This function does nothing. It can be used to alias other symbols to it via
 * linker flags, such as atexit(). @return 0. */
int ignore_fn(void)
{
    return 0;
}

#if !defined(ESP32)

#if !defined (__MINGW32__)
int main(int argc, char *argv[]) __attribute__ ((weak));
#endif

/** Entry point to program.
 * @param argc number of command line arguments
 * @param argv array of command line aguments
 * @return 0, should never return
 */
int main(int argc, char *argv[])
{
#if defined (__FreeRTOS__)
    /* initialize the processor hardware */
    hw_init();

    ThreadPriv *priv = malloc(sizeof(ThreadPriv));
    xTaskHandle task_handle;
    int priority;
    priv->reent = _impure_ptr;
    priv->selectEventBit = 0;
    priv->entry = NULL;
    priv->arg = NULL;
    
    if (config_main_thread_priority() == 0xdefa01)
    {
        priority = configMAX_PRIORITIES / 2;
    }
    else
    {
        priority = config_main_thread_priority();
    }
    
#ifndef TARGET_LPC11Cxx
    /* stdin */
    if (open(STDIN_DEVICE, O_RDWR) < 0)
    {
        open("/dev/null", O_RDWR);
    }
    /* stdout */
    if (open(STDOUT_DEVICE, O_RDWR) < 0)
    {
        open("/dev/null", O_RDWR);
    }
    /* stderr */
    if (open(STDERR_DEVICE, O_WRONLY) < 0)
    {
        open("/dev/null", O_WRONLY);
    }
#endif

    /* start the main thread */
#if (configSUPPORT_STATIC_ALLOCATION == 1)
    task_handle = xTaskCreateStatic(main_thread, (char *)"thread.main",
                                    config_main_thread_stack_size() / sizeof(portSTACK_TYPE), priv,
                                    priority,
                                    (StackType_t *)stack_malloc(config_main_thread_stack_size()),
                                    (StaticTask_t *) malloc(sizeof(StaticTask_t)));
#elif (configSUPPORT_DYNAMIC_ALLOCATION == 1)
    xTaskCreate(main_thread, (char *)"thread.main",
                config_main_thread_stack_size() / sizeof(portSTACK_TYPE), priv,
                priority,
                &task_handle);
#else
    xTaskGenericCreate(main_thread, (char *)"thread.main",
                       config_main_thread_stack_size() / sizeof(portSTACK_TYPE), priv,
                       priority, &task_handle,
                       (long unsigned int *)stack_malloc(config_main_thread_stack_size()),
                       NULL);
#endif
    TaskList *task_new = malloc(sizeof(TaskList));
    task_new->task = task_handle;
    task_new->unused = config_main_thread_stack_size();
    task_new->name = "thread.main";
    add_thread_to_task_list(task_new);

    vTaskStartScheduler();
#else
#if defined (__WIN32__)
    /* enable Windows networking */
    WSADATA wsa_data;
    WSAStartup(WINSOCK_VERSION, &wsa_data);
#endif
    return appl_main(argc, argv);
#endif
}

#endif // ESP32

#if defined(ARDUINO)
unsigned critical_nesting;
#endif

#if 0 && defined(ESP_NONOS)
struct _reent *_impure_ptr = NULL;
static int my_errno;
int* __errno(void) {
    return &my_errno;
}
#endif
